rocksdb/ssd/workloadb.log
/home/hustzyw/jdk1.8.0_191/bin/java -cp /home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/rocksdb-binding/conf:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/conf:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/core-0.15.0.jar:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/htrace-core4-4.1.0-incubating.jar:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/jackson-mapper-asl-1.9.4.jar:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/jackson-core-asl-1.9.4.jar:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/HdrHistogram-2.1.4.jar:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/jcip-annotations-1.0.jar:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/slf4j-api-1.7.25.jar:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/slf4j-simple-1.7.25.jar:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/rocksdb-binding-0.15.0.jar:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/fb-rocksdbjni-5.18.0.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.rocksdb.RocksDBClient -s -P our-nvm-workloads/workloadb -p rocksdb.dir=/mnt/ssd/ycsb-rocksdb-xiaohu -t
Command line: -db com.yahoo.ycsb.db.rocksdb.RocksDBClient -s -P our-nvm-workloads/workloadb -p rocksdb.dir=/mnt/ssd/ycsb-rocksdb-xiaohu -t
YCSB Client 0.15.0

Loading workload...
Starting test.
[Thread-3] INFO com.yahoo.ycsb.db.rocksdb.RocksDBClient - RocksDB data dir: /mnt/ssd/ycsb-rocksdb-xiaohu
2018-12-30 09:29:53:270 0 sec: 0 operations; est completion in 0 second 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2018-12-30 09:30:03:220 10 sec: 27333 operations; 2733.3 current ops/sec; est completion in 1 hour [READ: Count=26017, Max=30159, Min=1, Avg=288.24, 90=565, 99=780, 99.9=4011, 99.99=7603] [UPDATE: Count=1322, Max=2391, Min=17, Avg=319.78, 90=622, 99=843, 99.9=1958, 99.99=2391] 
2018-12-30 09:30:13:219 20 sec: 66064 operations; 3873.1 current ops/sec; est completion in 50 minutes [READ: Count=36806, Max=73215, Min=1, Avg=253.62, 90=539, 99=723, 99.9=3411, 99.99=6551] [UPDATE: Count=1927, Max=4663, Min=15, Avg=276.95, 90=562, 99=746, 99.9=2945, 99.99=4663] 
2018-12-30 09:30:23:220 30 sec: 107335 operations; 4127.1 current ops/sec; est completion in 46 minutes [READ: Count=39229, Max=72447, Min=1, Avg=238.46, 90=528, 99=723, 99.9=3227, 99.99=5511] [UPDATE: Count=2038, Max=6783, Min=16, Avg=262.86, 90=555, 99=709, 99.9=2623, 99.99=6783] 
2018-12-30 09:30:33:220 40 sec: 150434 operations; 4309.9 current ops/sec; est completion in 43 minutes [READ: Count=40977, Max=9871, Min=3, Avg=228.16, 90=524, 99=707, 99.9=2425, 99.99=5971] [UPDATE: Count=2124, Max=3967, Min=15, Avg=255.37, 90=546, 99=740, 99.9=1206, 99.99=3967] 
2018-12-30 09:30:43:220 50 sec: 193495 operations; 4306.1 current ops/sec; est completion in 42 minutes [READ: Count=40924, Max=13367, Min=2, Avg=228.47, 90=520, 99=734, 99.9=3629, 99.99=6583] [UPDATE: Count=2135, Max=5871, Min=14, Avg=253.92, 90=559, 99=751, 99.9=2797, 99.99=5871] 
2018-12-30 09:30:53:220 60 sec: 239610 operations; 4611.5 current ops/sec; est completion in 40 minutes [READ: Count=43761, Max=8019, Min=2, Avg=212.66, 90=494, 99=704, 99.9=3221, 99.99=5731] [UPDATE: Count=2354, Max=7947, Min=14, Avg=242.98, 90=537, 99=749, 99.9=2309, 99.99=7947] 
2018-12-30 09:31:03:220 70 sec: 286874 operations; 4726.4 current ops/sec; est completion in 39 minutes [READ: Count=44836, Max=49887, Min=1, Avg=207.75, 90=475, 99=708, 99.9=3369, 99.99=5563] [UPDATE: Count=2428, Max=4739, Min=14, Avg=234.54, 90=491, 99=723, 99.9=3493, 99.99=4739] 
2018-12-30 09:31:13:220 80 sec: 335478 operations; 4860.4 current ops/sec; est completion in 38 minutes [READ: Count=46165, Max=10791, Min=3, Avg=201.86, 90=452, 99=690, 99.9=2853, 99.99=5243] [UPDATE: Count=2438, Max=6295, Min=14, Avg=231.7, 90=516, 99=723, 99.9=3733, 99.99=6295] 
2018-12-30 09:31:23:219 90 sec: 386302 operations; 5082.4 current ops/sec; est completion in 37 minutes [READ: Count=48286, Max=12415, Min=3, Avg=192.72, 90=429, 99=684, 99.9=2975, 99.99=4707] [UPDATE: Count=2541, Max=4115, Min=14, Avg=224.02, 90=462, 99=691, 99.9=2465, 99.99=4115] 
2018-12-30 09:31:33:220 100 sec: 437159 operations; 5085.7 current ops/sec; est completion in 36 minutes [READ: Count=48386, Max=12135, Min=3, Avg=192.84, 90=424, 99=695, 99.9=2743, 99.99=6331] [UPDATE: Count=2467, Max=4615, Min=13, Avg=222.15, 90=460, 99=745, 99.9=3955, 99.99=4615] 
2018-12-30 09:31:43:220 110 sec: 490021 operations; 5286.2 current ops/sec; est completion in 35 minutes [READ: Count=50343, Max=14815, Min=3, Avg=185.55, 90=419, 99=669, 99.9=2587, 99.99=5755] [UPDATE: Count=2526, Max=4103, Min=14, Avg=212.44, 90=454, 99=715, 99.9=2679, 99.99=4103] 
2018-12-30 09:31:53:219 120 sec: 544283 operations; 5426.2 current ops/sec; est completion in 34 minutes [READ: Count=51544, Max=6883, Min=2, Avg=179.37, 90=411, 99=660, 99.9=3125, 99.99=4955] [UPDATE: Count=2713, Max=47711, Min=13, Avg=227.2, 90=445, 99=729, 99.9=2403, 99.99=47711] 
2018-12-30 09:32:03:220 130 sec: 597847 operations; 5356.4 current ops/sec; est completion in 34 minutes [READ: Count=50874, Max=12999, Min=2, Avg=182.88, 90=414, 99=674, 99.9=3287, 99.99=5831] [UPDATE: Count=2697, Max=6059, Min=14, Avg=211.46, 90=436, 99=695, 99.9=3273, 99.99=6059] 
2018-12-30 09:32:13:255 140 sec: 653850 operations; 5600.3 current ops/sec; est completion in 33 minutes [READ: Count=53241, Max=35871, Min=3, Avg=175.76, 90=404, 99=659, 99.9=3169, 99.99=6859] [UPDATE: Count=2759, Max=3557, Min=14, Avg=198.85, 90=426, 99=685, 99.9=3109, 99.99=3557] 
2018-12-30 09:32:23:219 150 sec: 711242 operations; 5739.2 current ops/sec; est completion in 32 minutes [READ: Count=54430, Max=66431, Min=3, Avg=169.89, 90=397, 99=641, 99.9=2831, 99.99=5335] [UPDATE: Count=2956, Max=17583, Min=14, Avg=198.24, 90=419, 99=640, 99.9=3291, 99.99=17583] 
2018-12-30 09:32:33:220 160 sec: 768874 operations; 5763.2 current ops/sec; est completion in 32 minutes [READ: Count=54778, Max=61727, Min=2, Avg=170.15, 90=399, 99=656, 99.9=2951, 99.99=6347] [UPDATE: Count=2856, Max=2349, Min=14, Avg=191.24, 90=424, 99=685, 99.9=2065, 99.99=2349] 
2018-12-30 09:32:43:220 170 sec: 827887 operations; 5901.3 current ops/sec; est completion in 31 minutes [READ: Count=56030, Max=12175, Min=3, Avg=165.67, 90=394, 99=645, 99.9=2949, 99.99=5591] [UPDATE: Count=2984, Max=5047, Min=14, Avg=194.34, 90=420, 99=730, 99.9=4171, 99.99=5047] 
2018-12-30 09:32:53:220 180 sec: 888266 operations; 6037.9 current ops/sec; est completion in 30 minutes [READ: Count=57381, Max=30511, Min=2, Avg=161.58, 90=388, 99=635, 99.9=3163, 99.99=5679] [UPDATE: Count=3003, Max=5071, Min=14, Avg=197.07, 90=421, 99=646, 99.9=3985, 99.99=5071] 
2018-12-30 09:33:03:220 190 sec: 950038 operations; 6177.2 current ops/sec; est completion in 30 minutes [READ: Count=58746, Max=76351, Min=3, Avg=158.64, 90=383, 99=622, 99.9=2313, 99.99=6055] [UPDATE: Count=3021, Max=3699, Min=15, Avg=178.69, 90=412, 99=646, 99.9=1318, 99.99=3699] 
2018-12-30 09:33:13:227 200 sec: 1011774 operations; 6173.6 current ops/sec; est completion in 29 minutes [READ: Count=58523, Max=11767, Min=2, Avg=158.12, 90=387, 99=623, 99.9=2781, 99.99=5407] [UPDATE: Count=3218, Max=5547, Min=15, Avg=186.16, 90=412, 99=675, 99.9=3101, 99.99=5547] 
2018-12-30 09:33:23:225 210 sec: 1076396 operations; 6458.97 current ops/sec; est completion in 29 minutes [READ: Count=61397, Max=10327, Min=2, Avg=151.18, 90=380, 99=601, 99.9=2675, 99.99=5411] [UPDATE: Count=3220, Max=2879, Min=14, Avg=176.77, 90=408, 99=620, 99.9=1277, 99.99=2879] 
2018-12-30 09:33:33:221 220 sec: 1141719 operations; 6534.26 current ops/sec; est completion in 28 minutes [READ: Count=61993, Max=14751, Min=3, Avg=148.24, 90=374, 99=602, 99.9=2759, 99.99=5063] [UPDATE: Count=3328, Max=4963, Min=14, Avg=176.28, 90=404, 99=633, 99.9=2973, 99.99=4963] 
2018-12-30 09:33:43:229 230 sec: 1206996 operations; 6523.13 current ops/sec; est completion in 27 minutes [READ: Count=62028, Max=55103, Min=3, Avg=149.54, 90=376, 99=612, 99.9=3245, 99.99=5675] [UPDATE: Count=3252, Max=4427, Min=15, Avg=178.59, 90=409, 99=649, 99.9=3051, 99.99=4427] 
2018-12-30 09:33:53:223 240 sec: 1273603 operations; 6664.03 current ops/sec; est completion in 27 minutes [READ: Count=63127, Max=57087, Min=3, Avg=146.12, 90=369, 99=597, 99.9=2683, 99.99=5539] [UPDATE: Count=3478, Max=4783, Min=15, Avg=177.85, 90=400, 99=654, 99.9=3729, 99.99=4783] 
2018-12-30 09:34:03:221 250 sec: 1343113 operations; 6952.39 current ops/sec; est completion in 26 minutes [READ: Count=66044, Max=10735, Min=2, Avg=139.68, 90=360, 99=583, 99.9=2377, 99.99=4583] [UPDATE: Count=3468, Max=7411, Min=14, Avg=169.42, 90=385, 99=616, 99.9=4487, 99.99=7411] 
2018-12-30 09:34:13:223 260 sec: 1412684 operations; 6955.71 current ops/sec; est completion in 26 minutes [READ: Count=66108, Max=25871, Min=3, Avg=139.06, 90=358, 99=578, 99.9=1831, 99.99=5387] [UPDATE: Count=3462, Max=5327, Min=14, Avg=166.33, 90=378, 99=597, 99.9=2897, 99.99=5327] 
2018-12-30 09:34:23:220 270 sec: 1482781 operations; 7012.51 current ops/sec; est completion in 25 minutes [READ: Count=66606, Max=9847, Min=3, Avg=138.48, 90=350, 99=582, 99.9=2733, 99.99=5419] [UPDATE: Count=3499, Max=16495, Min=14, Avg=175.85, 90=382, 99=627, 99.9=4041, 99.99=16495] 
2018-12-30 09:34:33:221 280 sec: 1555738 operations; 7294.97 current ops/sec; est completion in 25 minutes [READ: Count=69284, Max=59711, Min=3, Avg=133.42, 90=343, 99=562, 99.9=1617, 99.99=5031] [UPDATE: Count=3667, Max=10199, Min=14, Avg=161.51, 90=370, 99=570, 99.9=1643, 99.99=10199] 
2018-12-30 09:34:43:229 290 sec: 1627261 operations; 7145.87 current ops/sec; est completion in 24 minutes [READ: Count=68026, Max=46751, Min=3, Avg=136.16, 90=342, 99=573, 99.9=2521, 99.99=5295] [UPDATE: Count=3500, Max=2107, Min=15, Avg=163.21, 90=375, 99=601, 99.9=1599, 99.99=2107] 
2018-12-30 09:34:53:223 300 sec: 1701673 operations; 7445.67 current ops/sec; est completion in 24 minutes [READ: Count=70765, Max=10399, Min=3, Avg=130.97, 90=332, 99=569, 99.9=2441, 99.99=5071] [UPDATE: Count=3645, Max=3201, Min=14, Avg=152.09, 90=341, 99=567, 99.9=1508, 99.99=3201] 
2018-12-30 09:35:03:223 310 sec: 1777415 operations; 7574.2 current ops/sec; est completion in 23 minutes [READ: Count=72020, Max=69183, Min=1, Avg=128.62, 90=307, 99=551, 99.9=2227, 99.99=4959] [UPDATE: Count=3721, Max=6003, Min=10, Avg=152.86, 90=318, 99=548, 99.9=2453, 99.99=6003] 
2018-12-30 09:35:13:224 320 sec: 1852504 operations; 7508.9 current ops/sec; est completion in 23 minutes [READ: Count=71273, Max=46175, Min=3, Avg=128.81, 90=299, 99=549, 99.9=1940, 99.99=4803] [UPDATE: Count=3821, Max=34399, Min=14, Avg=169.63, 90=335, 99=607, 99.9=3159, 99.99=34399] 
2018-12-30 09:35:23:219 330 sec: 1929977 operations; 7750.4 current ops/sec; est completion in 23 minutes [READ: Count=73538, Max=9175, Min=1, Avg=124.66, 90=289, 99=531, 99.9=1644, 99.99=5459] [UPDATE: Count=3928, Max=47039, Min=14, Avg=166.63, 90=328, 99=566, 99.9=1514, 99.99=47039] 
2018-12-30 09:35:33:223 340 sec: 2005698 operations; 7569.07 current ops/sec; est completion in 22 minutes [READ: Count=71973, Max=70975, Min=3, Avg=126.87, 90=288, 99=541, 99.9=2137, 99.99=4691] [UPDATE: Count=3746, Max=98751, Min=15, Avg=186.94, 90=328, 99=593, 99.9=3765, 99.99=98751] 
2018-12-30 09:35:43:220 350 sec: 2084778 operations; 7910.37 current ops/sec; est completion in 22 minutes [READ: Count=75160, Max=61055, Min=3, Avg=122.58, 90=283, 99=529, 99.9=1752, 99.99=4919] [UPDATE: Count=3922, Max=3755, Min=13, Avg=152.55, 90=310, 99=564, 99.9=2395, 99.99=3755] 
2018-12-30 09:35:53:222 360 sec: 2163951 operations; 7915.72 current ops/sec; est completion in 21 minutes [READ: Count=75267, Max=98111, Min=3, Avg=122.7, 90=276, 99=527, 99.9=2517, 99.99=4831] [UPDATE: Count=3902, Max=5583, Min=15, Avg=150.6, 90=307, 99=548, 99.9=1460, 99.99=5583] 
2018-12-30 09:36:03:228 370 sec: 2245697 operations; 8170.51 current ops/sec; est completion in 21 minutes [READ: Count=77687, Max=12287, Min=3, Avg=118.6, 90=273, 99=521, 99.9=2095, 99.99=4627] [UPDATE: Count=4063, Max=5119, Min=14, Avg=150.48, 90=301, 99=553, 99.9=2761, 99.99=5119] 
2018-12-30 09:36:13:222 380 sec: 2326796 operations; 8113.96 current ops/sec; est completion in 20 minutes [READ: Count=77016, Max=118015, Min=3, Avg=119.62, 90=269, 99=519, 99.9=2115, 99.99=4775] [UPDATE: Count=4088, Max=7743, Min=14, Avg=146.77, 90=302, 99=533, 99.9=1776, 99.99=7743] 
2018-12-30 09:36:23:220 390 sec: 2408337 operations; 8156.55 current ops/sec; est completion in 20 minutes [READ: Count=77341, Max=80191, Min=1, Avg=119.13, 90=263, 99=516, 99.9=2497, 99.99=4447] [UPDATE: Count=4195, Max=4719, Min=15, Avg=143.71, 90=283, 99=538, 99.9=2015, 99.99=4719] 
2018-12-30 09:36:33:223 400 sec: 2492245 operations; 8387.45 current ops/sec; est completion in 20 minutes [READ: Count=79640, Max=22767, Min=1, Avg=115.79, 90=250, 99=508, 99.9=2213, 99.99=4823] [UPDATE: Count=4264, Max=3683, Min=13, Avg=139.37, 90=287, 99=519, 99.9=1201, 99.99=3683] 
2018-12-30 09:36:43:222 410 sec: 2576997 operations; 8476.05 current ops/sec; est completion in 19 minutes [READ: Count=80551, Max=54335, Min=2, Avg=114.42, 90=245, 99=490, 99.9=2029, 99.99=4811] [UPDATE: Count=4204, Max=3157, Min=14, Avg=138.81, 90=275, 99=500, 99.9=1419, 99.99=3157] 
2018-12-30 09:36:53:223 420 sec: 2663710 operations; 8670.43 current ops/sec; est completion in 19 minutes [READ: Count=82451, Max=11439, Min=3, Avg=111.88, 90=243, 99=495, 99.9=1748, 99.99=3951] [UPDATE: Count=4262, Max=2543, Min=15, Avg=137.28, 90=274, 99=541, 99.9=1428, 99.99=2543] 
2018-12-30 09:37:03:228 430 sec: 2749266 operations; 8552.18 current ops/sec; est completion in 18 minutes [READ: Count=81271, Max=13551, Min=3, Avg=113.1, 90=248, 99=481, 99.9=1643, 99.99=3497] [UPDATE: Count=4285, Max=3755, Min=14, Avg=143.5, 90=276, 99=527, 99.9=2945, 99.99=3755] 
2018-12-30 09:37:13:223 440 sec: 2836055 operations; 8682.37 current ops/sec; est completion in 18 minutes [READ: Count=82469, Max=131007, Min=3, Avg=111.8, 90=241, 99=470, 99.9=1751, 99.99=4051] [UPDATE: Count=4325, Max=3453, Min=14, Avg=134.98, 90=270, 99=470, 99.9=1362, 99.99=3453] 
2018-12-30 09:37:23:229 450 sec: 2921680 operations; 8558.22 current ops/sec; est completion in 18 minutes [READ: Count=81359, Max=72575, Min=2, Avg=113.18, 90=246, 99=473, 99.9=2271, 99.99=5227] [UPDATE: Count=4267, Max=4683, Min=15, Avg=142.34, 90=282, 99=529, 99.9=2257, 99.99=4683] 
2018-12-30 09:37:33:223 460 sec: 3009378 operations; 8774.19 current ops/sec; est completion in 17 minutes [READ: Count=83295, Max=11743, Min=3, Avg=110.41, 90=241, 99=456, 99.9=2127, 99.99=5051] [UPDATE: Count=4400, Max=7811, Min=14, Avg=137.03, 90=268, 99=503, 99.9=3039, 99.99=7811] 
2018-12-30 09:37:43:228 470 sec: 3098125 operations; 8871.15 current ops/sec; est completion in 17 minutes [READ: Count=84241, Max=94591, Min=3, Avg=109.14, 90=240, 99=459, 99.9=1876, 99.99=4871] [UPDATE: Count=4508, Max=3823, Min=14, Avg=136.42, 90=272, 99=503, 99.9=1375, 99.99=3823] 
2018-12-30 09:37:53:223 480 sec: 3187903 operations; 8981.39 current ops/sec; est completion in 17 minutes [READ: Count=85381, Max=29727, Min=3, Avg=107.91, 90=239, 99=456, 99.9=2321, 99.99=4831] [UPDATE: Count=4388, Max=2479, Min=15, Avg=130.8, 90=271, 99=466, 99.9=1051, 99.99=2479] 
2018-12-30 09:38:03:228 490 sec: 3278183 operations; 9024.39 current ops/sec; est completion in 16 minutes [READ: Count=85673, Max=53439, Min=1, Avg=105.93, 90=238, 99=441, 99.9=1911, 99.99=4719] [UPDATE: Count=4611, Max=4147, Min=7, Avg=134.39, 90=268, 99=460, 99.9=2449, 99.99=4147] 
2018-12-30 09:38:13:223 500 sec: 3369229 operations; 9109.15 current ops/sec; est completion in 16 minutes [READ: Count=86597, Max=41727, Min=1, Avg=106.04, 90=238, 99=435, 99.9=2041, 99.99=4535] [UPDATE: Count=4455, Max=14263, Min=15, Avg=137.31, 90=271, 99=478, 99.9=1892, 99.99=14263] 
2018-12-30 09:38:23:225 510 sec: 3460079 operations; 9082.28 current ops/sec; est completion in 16 minutes [READ: Count=86253, Max=109311, Min=1, Avg=106.31, 90=238, 99=431, 99.9=1856, 99.99=4407] [UPDATE: Count=4595, Max=5119, Min=8, Avg=137.78, 90=269, 99=501, 99.9=2963, 99.99=5119] 
2018-12-30 09:38:33:219 520 sec: 3552620 operations; 9259.66 current ops/sec; est completion in 15 minutes [READ: Count=87951, Max=11447, Min=2, Avg=104.18, 90=238, 99=426, 99.9=1928, 99.99=4679] [UPDATE: Count=4588, Max=4975, Min=14, Avg=131.02, 90=268, 99=494, 99.9=2695, 99.99=4975] 
2018-12-30 09:38:43:219 530 sec: 3647981 operations; 9536.1 current ops/sec; est completion in 15 minutes [READ: Count=90595, Max=12327, Min=3, Avg=101.37, 90=237, 99=417, 99.9=1849, 99.99=4751] [UPDATE: Count=4766, Max=1763, Min=14, Avg=127.68, 90=266, 99=453, 99.9=1238, 99.99=1763] 
2018-12-30 09:38:53:220 540 sec: 3741879 operations; 9388.86 current ops/sec; est completion in 15 minutes [READ: Count=89212, Max=29215, Min=3, Avg=102.96, 90=237, 99=423, 99.9=1908, 99.99=4863] [UPDATE: Count=4683, Max=4387, Min=14, Avg=130.1, 90=266, 99=447, 99.9=1800, 99.99=4387] 
2018-12-30 09:39:03:228 550 sec: 3837761 operations; 9581.49 current ops/sec; est completion in 14 minutes [READ: Count=90987, Max=79743, Min=3, Avg=100.9, 90=236, 99=417, 99.9=1810, 99.99=4443] [UPDATE: Count=4896, Max=5203, Min=14, Avg=125.99, 90=263, 99=442, 99.9=1417, 99.99=5203] 
2018-12-30 09:39:13:223 560 sec: 3932232 operations; 9450.88 current ops/sec; est completion in 14 minutes [READ: Count=89672, Max=48703, Min=3, Avg=102.08, 90=239, 99=419, 99.9=2121, 99.99=4675] [UPDATE: Count=4801, Max=4543, Min=14, Avg=130.32, 90=270, 99=457, 99.9=2487, 99.99=4543] 
2018-12-30 09:39:23:226 570 sec: 4026725 operations; 9447.41 current ops/sec; est completion in 14 minutes [READ: Count=89697, Max=109055, Min=3, Avg=102.27, 90=239, 99=418, 99.9=2121, 99.99=4355] [UPDATE: Count=4801, Max=5335, Min=15, Avg=129.39, 90=270, 99=447, 99.9=1583, 99.99=5335] 
2018-12-30 09:39:33:223 580 sec: 4124735 operations; 9802.96 current ops/sec; est completion in 13 minutes [READ: Count=93202, Max=59551, Min=3, Avg=98.44, 90=236, 99=411, 99.9=1585, 99.99=4727] [UPDATE: Count=4801, Max=4111, Min=14, Avg=126.25, 90=267, 99=443, 99.9=1136, 99.99=4111] 
2018-12-30 09:39:43:226 590 sec: 4223401 operations; 9864.63 current ops/sec; est completion in 13 minutes [READ: Count=93654, Max=7123, Min=3, Avg=97.77, 90=235, 99=410, 99.9=2113, 99.99=4395] [UPDATE: Count=5014, Max=4259, Min=15, Avg=125.82, 90=266, 99=436, 99.9=1159, 99.99=4251] 
2018-12-30 09:39:53:222 600 sec: 4323973 operations; 10061.22 current ops/sec; est completion in 13 minutes [READ: Count=95516, Max=47423, Min=2, Avg=95.88, 90=234, 99=407, 99.9=1627, 99.99=4883] [UPDATE: Count=5053, Max=2819, Min=9, Avg=122.42, 90=262, 99=436, 99.9=1297, 99.99=2423] 
2018-12-30 09:40:03:223 610 sec: 4424769 operations; 10078.59 current ops/sec; est completion in 12 minutes [READ: Count=95729, Max=12311, Min=3, Avg=95.72, 90=234, 99=407, 99.9=2167, 99.99=5119] [UPDATE: Count=5073, Max=3417, Min=14, Avg=122.02, 90=263, 99=427, 99.9=1506, 99.99=2137] 
2018-12-30 09:40:13:223 620 sec: 4526114 operations; 10133.49 current ops/sec; est completion in 12 minutes [READ: Count=96314, Max=142079, Min=3, Avg=95.07, 90=233, 99=394, 99.9=1786, 99.99=4551] [UPDATE: Count=5032, Max=6067, Min=14, Avg=123.83, 90=263, 99=438, 99.9=2365, 99.99=5843] 
2018-12-30 09:40:23:220 630 sec: 4630390 operations; 10430.73 current ops/sec; est completion in 12 minutes [READ: Count=99049, Max=15159, Min=3, Avg=92.37, 90=233, 99=395, 99.9=1749, 99.99=4759] [UPDATE: Count=5219, Max=3921, Min=13, Avg=119.14, 90=262, 99=416, 99.9=1249, 99.99=3127] 
2018-12-30 09:40:33:223 640 sec: 4734723 operations; 10430.17 current ops/sec; est completion in 11 minutes [READ: Count=99125, Max=9039, Min=1, Avg=91.59, 90=233, 99=396, 99.9=1540, 99.99=4491] [UPDATE: Count=5215, Max=96447, Min=10, Avg=137.72, 90=261, 99=419, 99.9=1981, 99.99=19247] 
2018-12-30 09:40:43:231 650 sec: 4838299 operations; 10356.56 current ops/sec; est completion in 11 minutes [READ: Count=98454, Max=9927, Min=3, Avg=92.97, 90=233, 99=395, 99.9=1908, 99.99=4763] [UPDATE: Count=5116, Max=4583, Min=14, Avg=119.13, 90=261, 99=418, 99.9=1633, 99.99=2215] 
2018-12-30 09:40:53:220 660 sec: 4942346 operations; 10409.9 current ops/sec; est completion in 11 minutes [READ: Count=98970, Max=29967, Min=3, Avg=92.5, 90=232, 99=396, 99.9=1976, 99.99=4799] [UPDATE: Count=5081, Max=4943, Min=15, Avg=119.78, 90=261, 99=422, 99.9=1989, 99.99=4087] 
2018-12-30 09:41:03:220 670 sec: 5044539 operations; 10218.28 current ops/sec; est completion in 10 minutes [READ: Count=97078, Max=128191, Min=3, Avg=93.09, 90=235, 99=395, 99.9=1577, 99.99=4423] [UPDATE: Count=5109, Max=128383, Min=14, Avg=142.96, 90=263, 99=426, 99.9=1624, 99.99=3551] 
2018-12-30 09:41:13:220 680 sec: 5146572 operations; 10204.32 current ops/sec; est completion in 10 minutes [READ: Count=96878, Max=135807, Min=3, Avg=94.48, 90=236, 99=393, 99.9=2018, 99.99=5115] [UPDATE: Count=5162, Max=2607, Min=15, Avg=120.37, 90=267, 99=418, 99.9=1187, 99.99=1741] 
2018-12-30 09:41:23:220 690 sec: 5253883 operations; 10731.1 current ops/sec; est completion in 10 minutes [READ: Count=101938, Max=42303, Min=3, Avg=89.77, 90=232, 99=388, 99.9=1551, 99.99=4619] [UPDATE: Count=5372, Max=2979, Min=14, Avg=114.81, 90=260, 99=407, 99.9=1152, 99.99=2945] 
2018-12-30 09:41:33:219 700 sec: 5360397 operations; 10651.4 current ops/sec; est completion in 10 minutes [READ: Count=101201, Max=108415, Min=3, Avg=90.59, 90=233, 99=390, 99.9=1594, 99.99=4839] [UPDATE: Count=5312, Max=2103, Min=13, Avg=112.2, 90=260, 99=410, 99.9=892, 99.99=1875] 
2018-12-30 09:41:43:224 710 sec: 5469984 operations; 10953.22 current ops/sec; est completion in 9 minutes [READ: Count=104059, Max=42815, Min=3, Avg=87.81, 90=231, 99=383, 99.9=1636, 99.99=4387] [UPDATE: Count=5523, Max=4275, Min=14, Avg=113.96, 90=259, 99=407, 99.9=1098, 99.99=3055] 
2018-12-30 09:41:53:219 720 sec: 5579007 operations; 10907.75 current ops/sec; est completion in 9 minutes [READ: Count=103534, Max=20655, Min=3, Avg=88.12, 90=232, 99=385, 99.9=1755, 99.99=4415] [UPDATE: Count=5495, Max=3523, Min=14, Avg=114.44, 90=260, 99=412, 99.9=1609, 99.99=3305] 
2018-12-30 09:42:03:225 730 sec: 5689455 operations; 11039.28 current ops/sec; est completion in 9 minutes [READ: Count=105019, Max=6519, Min=3, Avg=86.11, 90=231, 99=379, 99.9=1538, 99.99=4049] [UPDATE: Count=5432, Max=2855, Min=15, Avg=113.19, 90=259, 99=406, 99.9=918, 99.99=1730] 
2018-12-30 09:42:13:220 740 sec: 5802220 operations; 11282.14 current ops/sec; est completion in 8 minutes [READ: Count=107048, Max=5287, Min=3, Avg=84.73, 90=231, 99=377, 99.9=1302, 99.99=3825] [UPDATE: Count=5708, Max=5407, Min=14, Avg=111.63, 90=260, 99=403, 99.9=973, 99.99=3543] 
2018-12-30 09:42:23:220 750 sec: 5913473 operations; 11124.19 current ops/sec; est completion in 8 minutes [READ: Count=105665, Max=17471, Min=3, Avg=86.22, 90=231, 99=381, 99.9=1682, 99.99=4495] [UPDATE: Count=5594, Max=4895, Min=14, Avg=116, 90=260, 99=402, 99.9=1977, 99.99=4787] 
2018-12-30 09:42:33:219 760 sec: 6022744 operations; 10928.19 current ops/sec; est completion in 8 minutes [READ: Count=103880, Max=26191, Min=3, Avg=87.89, 90=234, 99=375, 99.9=1703, 99.99=4359] [UPDATE: Count=5387, Max=3799, Min=15, Avg=114.16, 90=264, 99=397, 99.9=877, 99.99=3015] 
2018-12-30 09:42:43:225 770 sec: 6134225 operations; 11142.53 current ops/sec; est completion in 8 minutes [READ: Count=105925, Max=7215, Min=3, Avg=86.2, 90=235, 99=378, 99.9=1689, 99.99=4037] [UPDATE: Count=5557, Max=3969, Min=14, Avg=114.28, 90=264, 99=399, 99.9=1675, 99.99=3909] 
2018-12-30 09:42:53:220 780 sec: 6249389 operations; 11522.16 current ops/sec; est completion in 7 minutes [READ: Count=109376, Max=9159, Min=3, Avg=83.04, 90=232, 99=360, 99.9=694, 99.99=4351] [UPDATE: Count=5788, Max=21823, Min=13, Avg=114.68, 90=261, 99=391, 99.9=917, 99.99=2161] 
2018-12-30 09:43:03:229 790 sec: 6367568 operations; 11810.81 current ops/sec; est completion in 7 minutes [READ: Count=112246, Max=4795, Min=3, Avg=81.14, 90=231, 99=355, 99.9=465, 99.99=614] [UPDATE: Count=5963, Max=10111, Min=15, Avg=108.9, 90=258, 99=385, 99.9=520, 99.99=6439] 
2018-12-30 09:43:13:220 800 sec: 6485396 operations; 11789.87 current ops/sec; est completion in 7 minutes [READ: Count=111789, Max=111487, Min=3, Avg=81.1, 90=231, 99=353, 99.9=471, 99.99=607] [UPDATE: Count=6010, Max=817, Min=15, Avg=109.31, 90=260, 99=383, 99.9=470, 99.99=588] 
2018-12-30 09:43:23:220 810 sec: 6605677 operations; 12028.1 current ops/sec; est completion in 6 minutes [READ: Count=114186, Max=15583, Min=3, Avg=79.56, 90=229, 99=350, 99.9=470, 99.99=696] [UPDATE: Count=6096, Max=953, Min=14, Avg=108.01, 90=259, 99=388, 99.9=501, 99.99=693] 
2018-12-30 09:43:33:220 820 sec: 6724410 operations; 11873.3 current ops/sec; est completion in 6 minutes [READ: Count=112847, Max=12063, Min=3, Avg=80.56, 90=233, 99=349, 99.9=447, 99.99=683] [UPDATE: Count=5892, Max=621, Min=14, Avg=109.29, 90=263, 99=387, 99.9=508, 99.99=574] 
2018-12-30 09:43:43:220 830 sec: 6847851 operations; 12344.1 current ops/sec; est completion in 6 minutes [READ: Count=117235, Max=8631, Min=3, Avg=77.52, 90=227, 99=345, 99.9=441, 99.99=574] [UPDATE: Count=6197, Max=644, Min=16, Avg=103.99, 90=256, 99=374, 99.9=447, 99.99=627] 
2018-12-30 09:43:53:229 840 sec: 6970870 operations; 12301.9 current ops/sec; est completion in 6 minutes [READ: Count=116839, Max=14663, Min=3, Avg=77.82, 90=228, 99=346, 99.9=446, 99.99=617] [UPDATE: Count=6180, Max=575, Min=13, Avg=104.54, 90=256, 99=377, 99.9=457, 99.99=556] 
2018-12-30 09:44:03:223 850 sec: 7095046 operations; 12413.88 current ops/sec; est completion in 5 minutes [READ: Count=118049, Max=9607, Min=3, Avg=77.03, 90=228, 99=342, 99.9=439, 99.99=608] [UPDATE: Count=6135, Max=5943, Min=15, Avg=103.36, 90=257, 99=376, 99.9=458, 99.99=657] 
2018-12-30 09:44:13:226 860 sec: 7221679 operations; 12658.24 current ops/sec; est completion in 5 minutes [READ: Count=120225, Max=34815, Min=1, Avg=75.46, 90=226, 99=340, 99.9=432, 99.99=568] [UPDATE: Count=6398, Max=614, Min=11, Avg=103.25, 90=256, 99=363, 99.9=441, 99.99=527] 
2018-12-30 09:44:23:223 870 sec: 7346154 operations; 12452.48 current ops/sec; est completion in 5 minutes [READ: Count=118233, Max=24431, Min=3, Avg=76.68, 90=229, 99=342, 99.9=431, 99.99=652] [UPDATE: Count=6249, Max=1203, Min=13, Avg=105.27, 90=257, 99=377, 99.9=495, 99.99=976] 
2018-12-30 09:44:33:220 880 sec: 7470901 operations; 12477.2 current ops/sec; est completion in 4 minutes [READ: Count=118572, Max=47519, Min=1, Avg=76.55, 90=229, 99=342, 99.9=430, 99.99=612] [UPDATE: Count=6181, Max=1144, Min=15, Avg=104.78, 90=259, 99=376, 99.9=490, 99.99=703] 
2018-12-30 09:44:43:220 890 sec: 7600173 operations; 12927.2 current ops/sec; est completion in 4 minutes [READ: Count=122737, Max=7299, Min=3, Avg=73.61, 90=225, 99=336, 99.9=422, 99.99=550] [UPDATE: Count=6524, Max=12183, Min=15, Avg=104.33, 90=254, 99=368, 99.9=448, 99.99=525] 
2018-12-30 09:44:53:222 900 sec: 7728513 operations; 12831.43 current ops/sec; est completion in 4 minutes [READ: Count=121904, Max=54527, Min=3, Avg=74.39, 90=226, 99=335, 99.9=422, 99.99=563] [UPDATE: Count=6438, Max=597, Min=15, Avg=100.92, 90=254, 99=370, 99.9=448, 99.99=553] 
2018-12-30 09:45:03:225 910 sec: 7857015 operations; 12847.63 current ops/sec; est completion in 4 minutes [READ: Count=122077, Max=13671, Min=3, Avg=74.36, 90=227, 99=336, 99.9=428, 99.99=657] [UPDATE: Count=6426, Max=565, Min=15, Avg=100.97, 90=256, 99=371, 99.9=495, 99.99=563] 
2018-12-30 09:45:13:225 920 sec: 7986173 operations; 12914.51 current ops/sec; est completion in 3 minutes [READ: Count=122759, Max=120895, Min=3, Avg=73.91, 90=224, 99=331, 99.9=417, 99.99=535] [UPDATE: Count=6397, Max=538, Min=13, Avg=99.83, 90=254, 99=366, 99.9=437, 99.99=495] 
2018-12-30 09:45:23:224 930 sec: 8114688 operations; 12852.79 current ops/sec; est completion in 3 minutes [READ: Count=122132, Max=74559, Min=3, Avg=74.3, 90=227, 99=329, 99.9=425, 99.99=559] [UPDATE: Count=6384, Max=562, Min=14, Avg=99.81, 90=255, 99=349, 99.9=437, 99.99=499] 
2018-12-30 09:45:33:229 940 sec: 8246437 operations; 13168.32 current ops/sec; est completion in 3 minutes [READ: Count=125154, Max=6871, Min=3, Avg=72.28, 90=227, 99=328, 99.9=419, 99.99=554] [UPDATE: Count=6597, Max=1417, Min=13, Avg=100.54, 90=255, 99=366, 99.9=460, 99.99=598] 
2018-12-30 09:45:43:224 950 sec: 8380560 operations; 13419.01 current ops/sec; est completion in 3 minutes [READ: Count=127463, Max=833, Min=3, Avg=70.9, 90=224, 99=316, 99.9=415, 99.99=539] [UPDATE: Count=6656, Max=564, Min=14, Avg=98.75, 90=253, 99=365, 99.9=448, 99.99=490] 
2018-12-30 09:45:53:225 960 sec: 8516388 operations; 13581.44 current ops/sec; est completion in 2 minutes [READ: Count=128917, Max=7915, Min=3, Avg=70.1, 90=223, 99=315, 99.9=420, 99.99=534] [UPDATE: Count=6910, Max=4611, Min=14, Avg=97.52, 90=252, 99=361, 99.9=435, 99.99=524] 
2018-12-30 09:46:03:224 970 sec: 8646810 operations; 13043.5 current ops/sec; est completion in 2 minutes [READ: Count=124000, Max=89791, Min=2, Avg=73.1, 90=228, 99=320, 99.9=423, 99.99=596] [UPDATE: Count=6427, Max=1945, Min=15, Avg=99.87, 90=256, 99=372, 99.9=442, 99.99=562] 
2018-12-30 09:46:13:220 980 sec: 8783798 operations; 13705.65 current ops/sec; est completion in 2 minutes [READ: Count=130194, Max=19631, Min=3, Avg=69.52, 90=224, 99=312, 99.9=412, 99.99=554] [UPDATE: Count=6807, Max=533, Min=14, Avg=95.81, 90=251, 99=341, 99.9=434, 99.99=481] 
2018-12-30 09:46:23:224 990 sec: 8923575 operations; 13970.71 current ops/sec; est completion in 2 minutes [READ: Count=132751, Max=7527, Min=3, Avg=68.09, 90=222, 99=303, 99.9=410, 99.99=548] [UPDATE: Count=7009, Max=636, Min=14, Avg=95.6, 90=249, 99=345, 99.9=450, 99.99=560] 
2018-12-30 09:46:33:227 1000 sec: 9061414 operations; 13779.77 current ops/sec; est completion in 1 minute [READ: Count=130942, Max=11047, Min=3, Avg=69.06, 90=223, 99=309, 99.9=413, 99.99=586] [UPDATE: Count=6898, Max=612, Min=14, Avg=95.85, 90=251, 99=352, 99.9=459, 99.99=600] 
2018-12-30 09:46:43:224 1010 sec: 9197023 operations; 13566.33 current ops/sec; est completion in 1 minute [READ: Count=128802, Max=132735, Min=3, Avg=70.13, 90=224, 99=309, 99.9=416, 99.99=561] [UPDATE: Count=6806, Max=4971, Min=14, Avg=98.01, 90=253, 99=333, 99.9=427, 99.99=535] 
2018-12-30 09:46:53:223 1020 sec: 9332088 operations; 13507.85 current ops/sec; est completion in 1 minute [READ: Count=128247, Max=23423, Min=3, Avg=70.44, 90=227, 99=315, 99.9=421, 99.99=631] [UPDATE: Count=6826, Max=5183, Min=15, Avg=98.22, 90=255, 99=363, 99.9=470, 99.99=679] 
2018-12-30 09:47:03:222 1030 sec: 9468827 operations; 13673.9 current ops/sec; est completion in 58 seconds [READ: Count=129803, Max=12343, Min=2, Avg=69.5, 90=225, 99=307, 99.9=412, 99.99=643] [UPDATE: Count=6928, Max=586, Min=11, Avg=96.94, 90=255, 99=365, 99.9=424, 99.99=576] 
2018-12-30 09:47:13:224 1040 sec: 9609302 operations; 14046.1 current ops/sec; est completion in 43 seconds [READ: Count=133480, Max=109183, Min=2, Avg=67.89, 90=222, 99=302, 99.9=413, 99.99=1996] [UPDATE: Count=7012, Max=613, Min=10, Avg=91.79, 90=248, 99=350, 99.9=438, 99.99=579] 
2018-12-30 09:47:23:224 1050 sec: 9748409 operations; 13909.31 current ops/sec; est completion in 28 seconds [READ: Count=132077, Max=7731, Min=3, Avg=68.42, 90=221, 99=314, 99.9=1355, 99.99=4243] [UPDATE: Count=7013, Max=2771, Min=14, Avg=95.28, 90=249, 99=369, 99.9=960, 99.99=2157] 
2018-12-30 09:47:33:221 1060 sec: 9887462 operations; 13909.47 current ops/sec; est completion in 13 seconds [READ: Count=131993, Max=23919, Min=2, Avg=68.38, 90=221, 99=321, 99.9=1349, 99.99=4395] [UPDATE: Count=7059, Max=4791, Min=14, Avg=95.66, 90=249, 99=342, 99.9=928, 99.99=3405] 
2018-12-30 09:47:41:711 1068 sec: 10000000 operations; 13256.92 current ops/sec; [READ: Count=106881, Max=59839, Min=1, Avg=71.65, 90=225, 99=321, 99.9=1608, 99.99=4475] [CLEANUP: Count=1, Max=25023, Min=25008, Avg=25016, 90=25023, 99=25023, 99.9=25023, 99.99=25023] [UPDATE: Count=5655, Max=3687, Min=8, Avg=97.66, 90=254, 99=354, 99.9=1424, 99.99=3191] 
[OVERALL], RunTime(ms), 1068491
[OVERALL], Throughput(ops/sec), 9358.993196947846
[TOTAL_GCS_PS_Scavenge], Count, 221
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 6849
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.640997444058958
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 221
[TOTAL_GC_TIME], Time(ms), 6849
[TOTAL_GC_TIME_%], Time(%), 0.640997444058958
[READ], Operations, 9499373
[READ], AverageLatency(us), 102.95600351728477
[READ], MinLatency(us), 1
[READ], MaxLatency(us), 142079
[READ], 95thPercentileLatency(us), 347
[READ], 99thPercentileLatency(us), 526
[READ], Return=OK, 9499373
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 25016.0
[CLEANUP], MinLatency(us), 25008
[CLEANUP], MaxLatency(us), 25023
[CLEANUP], 95thPercentileLatency(us), 25023
[CLEANUP], 99thPercentileLatency(us), 25023
[UPDATE], Operations, 500627
[UPDATE], AverageLatency(us), 131.16027501513102
[UPDATE], MinLatency(us), 7
[UPDATE], MaxLatency(us), 128383
[UPDATE], 95thPercentileLatency(us), 377
[UPDATE], 99thPercentileLatency(us), 556
[UPDATE], Return=OK, 500627